Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFace Properties
The FacetedBrepFace type exposes the following members.
Properties
Name | Description
HasHoles
 Gets a value indicating whether this instance has holes.
Holes
 Gets the holes.
IsReadOnly
 Gets a value indicating whether this instance is read only.
VerticeIndexes
 Gets the vertex indexes.
Vertices
 Gets the vertices.
Top
See Also
Reference
FacetedBrepFace Class
Tekla.Structures.Geometry3d Namespace